In [1]:
import pandas as pd
import numpy as np

# Creating dataframe objects

In [2]:
arr = np.random.randint(0,10,(5,3))
arr

array([[3, 5, 0],
       [2, 4, 3],
       [7, 6, 1],
       [1, 1, 5],
       [7, 2, 9]])

In [3]:
df = pd.DataFrame(arr) #creating dataframe of arr

In [4]:
df

   0  1  2
0  3  5  0
1  2  4  3
2  7  6  1
3  1  1  5
4  7  2  9

In [5]:
df.values #printing dataframe in form of an array

array([[3, 5, 0],
       [2, 4, 3],
       [7, 6, 1],
       [1, 1, 5],
       [7, 2, 9]])

In [6]:
df.index #range of index

RangeIndex(start=0, stop=5, step=1)

In [7]:
df.columns #range of columns

RangeIndex(start=0, stop=3, step=1)

In [8]:
for c in df.columns:
    print(c)

0
1
2

In [9]:
df.values[1]

array([2, 4, 3])

In [10]:
df.index = ['R1', 'R2', 'R3', 'R4', 'R5']
df.columns = ['C1', 'C2', 'C3'] #defining columns and indexs

In [11]:
df

    C1  C2  C3
R1   3   5   0
R2   2   4   3
R3   7   6   1
R4   1   1   5
R5   7   2   9

In [12]:
df.loc['R2','C3']

3

In [13]:
df.iloc[1,2]

3

In [14]:
df.loc['R3':'R5', 'C2':'C3']

    C2  C3
R3   6   1
R4   1   5
R5   2   9

In [15]:
df.iloc[0]

C1    3
C2    5
C3    0
Name: R1, dtype: int32

In [16]:
df.iloc[:,0]

R1    3
R2    2
R3    7
R4    1
R5    7
Name: C1, dtype: int32

In [17]:
df.shape

(5, 3)

In [18]:
df.T #transform the dataframe

    R1  R2  R3  R4  R5
C1   3   2   7   1   7
C2   5   4   6   1   2
C3   0   3   1   5   9

In [19]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146], 
                 index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370], 
                     index=['Mercury', 'Venus', 'Earth', 'Moon', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])

In [20]:
mass

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.8000
Neptune     102.0000
Pluto         0.0146
dtype: float64

In [21]:
diameter

Mercury      4879
Venus       12104
Earth       12756
Moon         3475
Mars         6792
Jupiter    142984
Saturn     120536
Uranus      51118
Neptune     49528
Pluto        2370
dtype: int64

In [22]:
df=pd.DataFrame({'Mass':mass,'Diameter':diameter})
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [23]:
df['Mass']#printing only Mass column

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

In [24]:
df['Diameter']

Earth       12756
Jupiter    142984
Mars         6792
Mercury      4879
Moon         3475
Neptune     49528
Pluto        2370
Saturn     120536
Uranus      51118
Venus       12104
Name: Diameter, dtype: int64

In [25]:
df['Mass']['Earth'] #getting the mass of earth

5.97

In [26]:
df.Mass.Earth #alternative way

5.97

In [27]:
df['pop']=0 #adding 3rd column 
df

              Mass  Diameter  pop
Earth       5.9700     12756    0
Jupiter  1898.0000    142984    0
Mars        0.6420      6792    0
Mercury     0.3300      4879    0
Moon           NaN      3475    0
Neptune   102.0000     49528    0
Pluto       0.0146      2370    0
Saturn    568.0000    120536    0
Uranus     86.8000     51118    0
Venus       4.8700     12104    0

In [28]:
df['pop']['Earth'] = 800
df['pop']['Jupiter'] = 800
df['pop']['Mars'] = 800 #adding values to pop column

C:\Users\Varchasa Aggarwal\AppData\Local\Programs\Python\Python36\Lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Varchasa Aggarwal\AppData\Local\Programs\Python\Python36\Lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Varchasa Aggarwal\AppData\Local\Programs\Python\Python36\Lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [29]:
df

              Mass  Diameter  pop
Earth       5.9700     12756  800
Jupiter  1898.0000    142984  800
Mars        0.6420      6792  800
Mercury     0.3300      4879    0
Moon           NaN      3475    0
Neptune   102.0000     49528    0
Pluto       0.0146      2370    0
Saturn    568.0000    120536    0
Uranus     86.8000     51118    0
Venus       4.8700     12104    0

In [30]:
df['Mass'] is df.Mass

True

In [31]:
df['pop'] is df.pop

False

In [32]:
df.loc['Earth']

Mass            5.97
Diameter    12756.00
pop           800.00
Name: Earth, dtype: float64

In [33]:
df.loc[:,'Mass']

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

## creating mean row

In [34]:
np.mean(df['Mass']) #mean of column Mass

296.29184444444445

In [35]:
df.drop('pop',axis=1,inplace=True) #removing a column

In [36]:
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [37]:
def create_mean_row(df):
    df.loc['Col_Mean'] = df.mean()
    return df

In [38]:
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [40]:
df.loc['col_mean']=0 #adding a new row
df

               Mass  Diameter
Earth        5.9700     12756
Jupiter   1898.0000    142984
Mars         0.6420      6792
Mercury      0.3300      4879
Moon            NaN      3475
Neptune    102.0000     49528
Pluto        0.0146      2370
Saturn     568.0000    120536
Uranus      86.8000     51118
Venus        4.8700     12104
col_mean     0.0000         0

In [41]:
np.mean(df['Mass']) #calculating mean of Mass column

266.66266

In [42]:
df.drop('col_mean',inplace=True)

In [45]:
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [47]:
np.mean(df['Mass']) #mean after dropping col_mean row

296.29184444444445

In [48]:
df.loc['col_mean']=[np.mean(df['Mass']),np.mean(df['Diameter'])]

In [49]:
df

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
col_mean   296.291844   40654.2

In [51]:
df.drop('col_mean')

              Mass  Diameter
Earth       5.9700   12756.0
Jupiter  1898.0000  142984.0
Mars        0.6420    6792.0
Mercury     0.3300    4879.0
Moon           NaN    3475.0
Neptune   102.0000   49528.0
Pluto       0.0146    2370.0
Saturn    568.0000  120536.0
Uranus     86.8000   51118.0
Venus       4.8700   12104.0

In [52]:
create_mean_row(df)

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
col_mean   296.291844   40654.2
Col_Mean   296.291844   40654.2

## creating dataframe

In [54]:
def create_df(nRows, nCols, maxRand=10):
    arr = np.random.randint(0, maxRand, (nRows, nCols))
    df = pd.DataFrame(arr)
    df.index = ['R' + str(x) for x in np.arange(1, nRows+1)]
    df.columns = ['C' + str(x) for x in np.arange(1, nCols+1)]
    return df

In [60]:
df=create_df(5,3)
df

    C1  C2  C3
R1   9   5   5
R2   6   3   0
R3   5   9   2
R4   3   5   3
R5   3   8   0

In [65]:
df.mean() #calculating mean column wise

C1    5.2
C2    6.0
C3    2.0
dtype: float64

In [64]:
df.mean(axis=1) #mean row wise

R1    6.333333
R2    3.000000
R3    5.333333
R4    3.666667
R5    3.666667
dtype: float64

In [66]:
df['Row_mean']=df.mean(axis=1)

In [67]:
df.loc['col_mean']=df.mean()
df

           C1   C2   C3  Row_mean
R1        9.0  5.0  5.0  6.333333
R2        6.0  3.0  0.0  3.000000
R3        5.0  9.0  2.0  5.333333
R4        3.0  5.0  3.0  3.666667
R5        3.0  8.0  0.0  3.666667
col_mean  5.2  6.0  2.0  4.400000

In [68]:
df.median() #column wise median

C1          5.100000
C2          5.500000
C3          2.000000
Row_mean    4.033333
dtype: float64

In [69]:
df.min() #min no. of each row

C1          3.0
C2          3.0
C3          0.0
Row_mean    3.0
dtype: float64

In [70]:
df.max() #max no. of each row

C1          9.000000
C2          9.000000
C3          5.000000
Row_mean    6.333333
dtype: float64

In [71]:
df.quantile(0.25)

C1          3.500000
C2          5.000000
C3          0.500000
Row_mean    3.666667
Name: 0.25, dtype: float64

In [72]:
df.drop('Row_mean', axis=1)

           C1   C2   C3
R1        9.0  5.0  5.0
R2        6.0  3.0  0.0
R3        5.0  9.0  2.0
R4        3.0  5.0  3.0
R5        3.0  8.0  0.0
col_mean  5.2  6.0  2.0

In [73]:
df.describe()  #gives all the neccessary calculations

             C1       C2        C3  Row_mean
count  6.000000  6.00000  6.000000  6.000000
mean   5.200000  6.00000  2.000000  4.400000
std    2.227106  2.19089  1.897367  1.236482
min    3.000000  3.00000  0.000000  3.000000
25%    3.500000  5.00000  0.500000  3.666667
50%    5.100000  5.50000  2.000000  4.033333
75%    5.800000  7.50000  2.750000  5.100000
max    9.000000  9.00000  5.000000  6.333333

In [74]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146], 
                 index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370], 
                     index=['Mercury', 'Venus', 'Earth', 'Moon', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])

In [75]:
planets = pd.DataFrame({'mass': mass, 'diameter': diameter})

In [76]:
planets.describe()

              mass      diameter
count     9.000000      10.00000
mean    296.291844   40654.20000
std     627.786429   51541.39142
min       0.014600    2370.00000
25%       0.642000    5357.25000
50%       5.970000   12430.00000
75%     102.000000   50720.50000
max    1898.000000  142984.00000